In [11]:
import pandas as pd
import warnings 
warnings.filterwarnings('ignore')

In [2]:
df1 = pd.read_excel(r"C:\Users\prath\Desktop\Course\Machine Learning\Practice\Practice 1\Houses.xlsx")

In [3]:
df1

,area_sqft,bedrooms,bathrooms,age_years,distance_city_center_km,num_schools_nearby,crime_rate_index,price
0,3974,3,1,11,2.8,3,4.6,514.15
1,1660,3,1,16,14.4,6,3.5,125.82
2,2094,1,3,28,9.5,1,2.3,213.67
3,1930,5,2,5,4.2,7,4.3,327.44
4,1895,1,1,6,10.4,1,2.5,188.46
...,...,...,...,...,...,...,...,...
195,2106,2,2,18,6.0,3,3.5,283.23
196,3480,3,3,16,13.3,3,1.9,412.81
197,3475,4,1,20,6.5,4,3.1,397.51
198,1772,5,2,13,12.4,2,3.4,200.87
199,2568,1,2,8,7.1,2,3.1,300.52

In [4]:
df1.head()

,area_sqft,bedrooms,bathrooms,age_years,distance_city_center_km,num_schools_nearby,crime_rate_index,price
0,3974,3,1,11,2.8,3,4.6,514.15
1,1660,3,1,16,14.4,6,3.5,125.82
2,2094,1,3,28,9.5,1,2.3,213.67
3,1930,5,2,5,4.2,7,4.3,327.44
4,1895,1,1,6,10.4,1,2.5,188.46

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   area_sqft                200 non-null    int64
 1   bedrooms                 200 non-null    int64
 2   bathrooms                200 non-null    int64
 3   age_years                200 non-null    int64
 4   distance_city_center_km  200 non-null    float64
 5   num_schools_nearby       200 non-null    int64
 6   crime_rate_index         200 non-null    float64
 7   price                    200 non-null    float64
dtypes: float64(3), int64(5)
memory usage: 12.6 KB

In [7]:
df1.describe(include="all")

,area_sqft,bedrooms,bathrooms,age_years,distance_city_center_km,num_schools_nearby,crime_rate_index,price
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,2509.580000,2.790000,1.905000,14.710000,7.409500,4.885000,3.051500,327.164200
std,898.436875,1.384008,0.830314,8.780741,3.896521,2.581686,1.166491,113.913716
min,821.000000,1.000000,1.000000,0.000000,1.200000,1.000000,1.000000,37.580000
25%,1810.750000,1.000000,1.000000,7.000000,3.775000,3.000000,2.100000,240.812500
50%,2481.500000,3.000000,2.000000,15.000000,7.100000,5.000000,3.100000,327.945000
75%,3356.500000,4.000000,3.000000,22.000000,10.400000,7.000000,4.000000,415.150000
max,3974.000000,5.000000,3.000000,29.000000,14.900000,9.000000,5.000000,564.630000

In [10]:
df1.isnull().sum()

area_sqft                  0
bedrooms                   0
bathrooms                  0
age_years                  0
distance_city_center_km    0
num_schools_nearby         0
crime_rate_index           0
price                      0
dtype: int64

In [14]:
X1 = df1.drop("price", axis=1)
y1 = df1["price"]

from sklearn.model_selection import train_test_split
X1_train, X1_test, y1_train, y1_test = train_test_split(X1, y1, test_size=0.2, random_state=42)

In [17]:
from sklearn.linear_model import LinearRegression

model1 = LinearRegression()
model1.fit(X1_train, y1_train)
y1_pred = model1.predict(X1_test)

In [18]:
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error
import numpy as np

print("R²:", r2_score(y1_test, y1_pred))
print("MAE:", mean_absolute_error(y1_test, y1_pred))
print("RMSE:", np.sqrt(mean_squared_error(y1_test, y1_pred)))

R²: 0.9563757686958846
MAE: 21.904349645013184
RMSE: 25.84437377103728

In [19]:
coeff_df1 = pd.DataFrame(model1.coef_, X1.columns, columns=["Coefficient"])
print(coeff_df1)

                         Coefficient
area_sqft                   0.119222
bedrooms                   13.973715
bathrooms                  13.044038
age_years                  -1.848957
distance_city_center_km    -8.183488
num_schools_nearby          5.462319
crime_rate_index          -10.915531

## CSV File

In [20]:
df2 = pd.read_csv(r"C:\Users\prath\Desktop\Course\Machine Learning\Practice\Practice 1\linear_regression_numeric.csv")

In [21]:
df2

,area_sqft,bedrooms,bathrooms,age_years,distance_city_center_km,num_schools_nearby,crime_rate_index,price
0,3974,3,1,11,2.8,3,4.6,514.15
1,1660,3,1,16,14.4,6,3.5,125.82
2,2094,1,3,28,9.5,1,2.3,213.67
3,1930,5,2,5,4.2,7,4.3,327.44
4,1895,1,1,6,10.4,1,2.5,188.46
...,...,...,...,...,...,...,...,...
195,2106,2,2,18,6.0,3,3.5,283.23
196,3480,3,3,16,13.3,3,1.9,412.81
197,3475,4,1,20,6.5,4,3.1,397.51
198,1772,5,2,13,12.4,2,3.4,200.87
199,2568,1,2,8,7.1,2,3.1,300.52

In [22]:
df2.head()

,area_sqft,bedrooms,bathrooms,age_years,distance_city_center_km,num_schools_nearby,crime_rate_index,price
0,3974,3,1,11,2.8,3,4.6,514.15
1,1660,3,1,16,14.4,6,3.5,125.82
2,2094,1,3,28,9.5,1,2.3,213.67
3,1930,5,2,5,4.2,7,4.3,327.44
4,1895,1,1,6,10.4,1,2.5,188.46

In [23]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   area_sqft                200 non-null    int64
 1   bedrooms                 200 non-null    int64
 2   bathrooms                200 non-null    int64
 3   age_years                200 non-null    int64
 4   distance_city_center_km  200 non-null    float64
 5   num_schools_nearby       200 non-null    int64
 6   crime_rate_index         200 non-null    float64
 7   price                    200 non-null    float64
dtypes: float64(3), int64(5)
memory usage: 12.6 KB

In [25]:
df2.describe(include="all")

,area_sqft,bedrooms,bathrooms,age_years,distance_city_center_km,num_schools_nearby,crime_rate_index,price
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,2509.580000,2.790000,1.905000,14.710000,7.409500,4.885000,3.051500,327.164200
std,898.436875,1.384008,0.830314,8.780741,3.896521,2.581686,1.166491,113.913716
min,821.000000,1.000000,1.000000,0.000000,1.200000,1.000000,1.000000,37.580000
25%,1810.750000,1.000000,1.000000,7.000000,3.775000,3.000000,2.100000,240.812500
50%,2481.500000,3.000000,2.000000,15.000000,7.100000,5.000000,3.100000,327.945000
75%,3356.500000,4.000000,3.000000,22.000000,10.400000,7.000000,4.000000,415.150000
max,3974.000000,5.000000,3.000000,29.000000,14.900000,9.000000,5.000000,564.630000

In [26]:
df2.isnull().sum()

area_sqft                  0
bedrooms                   0
bathrooms                  0
age_years                  0
distance_city_center_km    0
num_schools_nearby         0
crime_rate_index           0
price                      0
dtype: int64

In [27]:
X2 = df2.drop("price", axis=1)
y2 = df2["price"]

X2_train, X2_test, y2_train, y2_test = train_test_split(X2, y2, test_size=0.2, random_state=42)

In [28]:
model2 = LinearRegression()
model2.fit(X2_train, y2_train)
y2_pred = model2.predict(X2_test)

In [29]:
print("R²:", r2_score(y2_test, y2_pred))
print("MAE:", mean_absolute_error(y2_test, y2_pred))
print("RMSE:", np.sqrt(mean_squared_error(y2_test, y2_pred)))

R²: 0.9563757686958846
MAE: 21.904349645013184
RMSE: 25.84437377103728

In [30]:
coeff_df2 = pd.DataFrame(model2.coef_, X2.columns, columns=["Coefficient"])
print(coeff_df2)

                         Coefficient
area_sqft                   0.119222
bedrooms                   13.973715
bathrooms                  13.044038
age_years                  -1.848957
distance_city_center_km    -8.183488
num_schools_nearby          5.462319
crime_rate_index          -10.915531